In [1]:

import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
        }
df= pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [3]:
# display top three rows of the dataframe

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
# display last three rows of the dataset

In [6]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
# find the shape of the dataframe that is rows and columns

In [8]:
df.shape

(7, 3)

In [10]:
df.shape[0]

7

In [11]:
df.shape[1]

3

In [12]:
# get the information about dataset

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [15]:
# check the null values

In [21]:
df.isnull().sum(axis=1)
df.isnull().sum(axis=0)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [23]:
# get the statistic of the dataframe
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [26]:
# find the unique values for the gender columns
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [27]:
# find the number of unique columns in the gender columns
df.Gender.nunique()

2

In [28]:
# dispay the count if unique values in the gender columns
df.Gender.value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [29]:
# find the total number of students having the marks between 90 and 100

In [35]:
df[df.Marks >= 90]               #difference B/W count and sum

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [37]:
df.Marks.between(90,100).sum()

4

In [48]:
len((df['Marks'] >= 90) &      (df['Marks'] < 90))

7

In [49]:
# find the average marks
df.Marks.mean()

92.14285714285714

In [51]:
# apply Method
# creating our own method

In [64]:
def marks(x):
    return x/2     # used // to use the floor division

In [65]:
df.Marks.apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [56]:
df["half_marks"]= df.Marks.apply(marks)

In [57]:
df

      Name  Marks  Gender  half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [67]:
# lambda function

df.Marks.apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [70]:
# find the length of the string 
df.Name.apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [76]:
# map function

df["Male&Female"]=df["Gender"].map({"Male":1,"Female":0}) 
df

      Name  Marks  Gender  half_marks  Male&Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [77]:
# drop the columns and cloumn

In [78]:
df.drop("Male&Female", axis=1)

      Name  Marks  Gender  half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [79]:
df.drop(["Male&Female","half_marks"], axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [80]:
# prints the name of columns

In [81]:
df.columns

Index(['Name', 'Marks', 'Gender', 'half_marks', 'Male&Female'], dtype='object')

In [83]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [86]:
# sort the data with marks
df.sort_values(by="Marks" , ascending=False)

      Name  Marks  Gender  half_marks  Male&Female
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0
0  Priyang     98    Male        49.0            1
4   Parshv     90    Male        45.0            1
1   Aadhya     89  Female        44.5            0
3   Vedant     87    Male        43.5            1
5   Mittal     83  Female        41.5            0

In [87]:
df.sort_values(by=["Marks","Gender"] , ascending=False)

      Name  Marks  Gender  half_marks  Male&Female
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0
0  Priyang     98    Male        49.0            1
4   Parshv     90    Male        45.0            1
1   Aadhya     89  Female        44.5            0
3   Vedant     87    Male        43.5            1
5   Mittal     83  Female        41.5            0

In [91]:
# display name and marks of the female student

df[df.Gender == "Female"] [["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [95]:
df[df.Gender.isin(["Female"])][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99